In [1]:
import pandas as pd

path = "C:/Users/rapa/Desktop/빅데이터분석기사실기/basic1(t114).csv"

df = pd.read_csv(path)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [5]:
# 주어진 데이터 셋에서 f2가 0값인 데이터를 age를 기준으로 오름차순 정렬하고
# 앞에서 부터 20개의 데이터를 추출한 후 
# f1 결측치(최소값)를 채우기 전과 후의 분산 차이를 계산하시오 (소수점 둘째 자리까지)

df2 = df[df['f2'] == 0]
print(df2.head())

      id   age city    f1  f2   f3    f4         f5
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
5   id06  22.0   서울  57.0   0  vip  INTP  20.129444
10  id11  40.0   서울  68.0   0  NaN  ENFP  98.429899
11  id12  20.0   서울   NaN   0  NaN  ESTP  91.297791
12  id13  15.0   서울  68.0   0  NaN  ESFJ  83.685380

In [17]:
df3 = df2.sort_values(by = 'age')
df4 = df3.reset_index().iloc[:20]

after_df = df4['f1'].fillna(df4['f1'].min())
astd = after_df.var()


before_df = df4['f1']
bstd = before_df.var()

In [19]:
round(abs(astd - bstd),2)

38.44